# 그룹 연산

1단계(분할) : 데이터를 특정 조건으로 분할
2단계(적용) : 데이터를 집계, 변환, 필터링에 필요한 함수 적용
3단계(결합) : 2단계의 처리 결과를 결합

## 1단계 : 그룹 객체 만들기

### 타이타닉 age, sex, class, fare, survived 열을 선택해서 class열 기준으로 그룹화

In [1]:
import pandas as pd
import seaborn as sns

In [33]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,  ['age', 'sex', 'class', 'fare', 'survived']]
grouped = df.groupby(['class'], observed=True)
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001B1DAA99130>

In [35]:
df['class'].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

### DataFrameGrouBy 객체가 리턴

In [41]:
for key, group in grouped:
    print("key : ", key)
    print("number : ", len(group)) 
    print(group.head(), end='\n')

key :  ('First',)
number :  216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1
key :  ('Second',)
number :  184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
key :  ('Third',)
number :  491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

### 그룹 연산 메소드
연산이 가능하도록 문자열 데이터는 제외시킨다.

In [45]:
avg = grouped.mean(numeric_only=True)
avg

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

### 그룹 객체 선택

In [65]:
group3 = grouped.get_group(name=('Third', ))
group3.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

### class, sex 열로 그룹화

In [79]:
grouped_two = df.groupby(['class', 'sex'], observed=True)
grouped_two

In [89]:
for key, group in grouped_two:
    print("#key : ", key)
    print("#number : ", len(group)) 
    print(group.head(), end='\n\n\n')

#key :  ('First', 'female')
#number :  94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1


#key :  ('First', 'male')
#number :  122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0


#key :  ('Second', 'female')
#number :  76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1


#key :  ('Second', 'male')
#number :  108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0


#key :  ('Third', 'female')
#number :  144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0


#key :  ('Third', 'male')
#number :  347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

### 그룹 객체 연산

In [93]:
avg_two = grouped_two.mean(numeric_only=True)
avg_two

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

### 멀티 인덱스의 특정 그룹만 추출

In [99]:
group_3 = grouped_two.get_group(('Third', 'female'))
group_3.head()

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

## 2단계 :

### 데이터 집계(aggregation)
mean, max, min, sum, count, size, var, std, describe, info, first, last, etc...

In [ ]:
### 각 그룹에 대해 각 열의 표준편차 계산, 각 그룹을 행 인덱스로 갖는 데이터 프레임 생성

In [113]:
std_all = grouped.std(numeric_only=True)
std_all

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949

In [115]:
std_all['fare']

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [117]:
std_all['fare'].std()

37.98844628499314

In [123]:
grouped['fare'].std(numeric_only=True)

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [125]:
grouped[['fare', 'age']].std()

             fare        age
class
First   78.380373  14.802856
Second  13.417399  14.001077
Third   11.778142  12.495398

In [ ]:
### agg() : 사용자 정의 함수 적용

In [129]:
grouped.describe()

          age                                                       fare  \
        count       mean        std   min   25%   50%   75%   max  count
class
First   186.0  38.233441  14.802856  0.92  27.0  37.0  49.0  80.0  216.0
Second  173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0  184.0
Third   355.0  25.140620  12.495398  0.42  18.0  24.0  32.0  74.0  491.0

                   ...                 survived                                \
             mean  ...   75%       max    count      mean       std  min  25%
class              ...
First   84.154687  ...  93.5  512.3292    216.0  0.629630  0.484026  0.0  0.0
Second  20.662183  ...  26.0   73.5000    184.0  0.472826  0.500623  0.0  0.0
Third   13.675550  ...  15.5   69.5500    491.0  0.242363  0.428949  0.0  0.0


        50%  75%  max
class
First   1.0  1.0  1.0
Second  0.0  1.0  1.0
Third   0.0  0.0  1.0

[3 rows x 24 columns]

In [131]:
grouped.value_counts()

class  age    sex     fare      survived
First  24.00  female  69.3000   1           2
       62.00  male    26.5500   0           2
       0.92   male    151.5500  1           1
       2.00   female  151.5500  0           1
       4.00   male    81.8583   1           1
                                           ..
Third  61.00  male    6.2375    0           1
       63.00  female  9.5875    1           1
       65.00  male    7.7500    0           1
       70.50  male    7.7500    0           1
       74.00  male    7.7750    0           1
Name: count, Length: 670, dtype: int64

In [133]:
grouped[['class', 'sex']].value_counts()

class   sex
First   male      122
        female     94
Second  male      108
        female     76
Third   male      347
        female    144
Name: count, dtype: int64

In [137]:
grouped.aggregate('mean', numeric_only=True)

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [149]:
grouped.agg('mean', numeric_only=True)

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [165]:
grouped.agg(['max', 'min'])

         age         sex              fare      survived
         max   min   max     min       max  min      max min
class
First   80.0  0.92  male  female  512.3292  0.0        1   0
Second  70.0  0.67  male  female   73.5000  0.0        1   0
Third   74.0  0.42  male  female   69.5500  0.0        1   0

In [167]:
grouped.agg({'fare':['min', 'max'], 'age':['mean']})

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

In [173]:
def min_max(x):
    return x.max() - x.min()


grouped[['fare', 'age']].agg(min_max)

            fare    age
class
First   512.3292  79.08
Second   73.5000  69.33
Third    69.5500  73.58

In [ ]:
## transform

In [ ]:
### 합계

In [177]:
grouped['fare'].sum()

class
First     18177.4125
Second     3801.8417
Third      6714.6951
Name: fare, dtype: float64

In [ ]:
### 누적합계

In [175]:
grouped['fare'].cumsum()

0          7.2500
1         71.2833
2         15.1750
3        124.3833
4         23.2250
          ...
886     3801.8417
887    18147.4125
888     6706.9451
889    18177.4125
890     6714.6951
Name: fare, Length: 891, dtype: float64

In [181]:
type(grouped['fare'].cumsum())

pandas.core.series.Series

In [183]:
df['fare_cumsum'] = grouped['fare'].cumsum()

In [185]:
df.head()

    age     sex  class     fare  survived  fare_cumsum
0  22.0    male  Third   7.2500         0       7.2500
1  38.0  female  First  71.2833         1      71.2833
2  26.0  female  Third   7.9250         1      15.1750
3  35.0  female  First  53.1000         1     124.3833
4  35.0    male  Third   8.0500         0      23.2250

In [187]:
grouped['fare'].transform('cumsum')

0          7.2500
1         71.2833
2         15.1750
3        124.3833
4         23.2250
          ...
886     3801.8417
887    18147.4125
888     6706.9451
889    18177.4125
890     6714.6951
Name: fare, Length: 891, dtype: float64

In [193]:
grouped[['fare']].transform('cumsum')

           fare
0        7.2500
1       71.2833
2       15.1750
3      124.3833
4       23.2250
..          ...
886   3801.8417
887  18147.4125
888   6706.9451
889  18177.4125
890   6714.6951

[891 rows x 1 columns]

In [195]:
for key, group in grouped:
    print("#key : ", key)
    print("#number : ", len(group)) 
    print(group.head(), end='\n\n\n')

#key :  ('First',)
#number :  216
     age     sex  class     fare  survived  fare_cumsum
1   38.0  female  First  71.2833         1      71.2833
3   35.0  female  First  53.1000         1     124.3833
6   54.0    male  First  51.8625         0     176.2458
11  58.0  female  First  26.5500         1     202.7958
23  28.0    male  First  35.5000         1     238.2958


#key :  ('Second',)
#number :  184
     age     sex   class     fare  survived  fare_cumsum
9   14.0  female  Second  30.0708         1      30.0708
15  55.0  female  Second  16.0000         1      46.0708
17   NaN    male  Second  13.0000         1      59.0708
20  35.0    male  Second  26.0000         0      85.0708
21  34.0    male  Second  13.0000         1      98.0708


#key :  ('Third',)
#number :  491
    age     sex  class     fare  survived  fare_cumsum
0  22.0    male  Third   7.2500         0       7.2500
2  26.0  female  Third   7.9250         1      15.1750
4  35.0    male  Third   8.0500         0      23.2250
5   NaN    male  Third   8.4583         0      31.6833
7   2.0    male  Third  21.0750         0      52.7583

In [197]:
grouped[['age', 'survived']].transform('mean')

           age  survived
0    25.140620  0.242363
1    38.233441  0.629630
2    25.140620  0.242363
3    38.233441  0.629630
4    25.140620  0.242363
..         ...       ...
886  29.877630  0.472826
887  38.233441  0.629630
888  25.140620  0.242363
889  38.233441  0.629630
890  25.140620  0.242363

[891 rows x 2 columns]

In [201]:
grouped['age'].unique()

class
First     [38.0, 35.0, 54.0, 58.0, 28.0, 19.0, 40.0, nan...
Second    [14.0, 55.0, nan, 35.0, 34.0, 66.0, 27.0, 3.0,...
Third     [22.0, 26.0, 35.0, nan, 2.0, 27.0, 4.0, 20.0, ...
Name: age, dtype: object

## age열에 포함된 개별데이터의 z-score 구하기 
z-score : (원소 값 - 평균값) / 표준편차

In [207]:
def z_score(x):
    return (x - x.mean()) / x.std()

grouped['age'].transform(z_score)

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

In [211]:
age_zscore = grouped['age'].transform(lambda x: (x - x.mean()) / x.std())

In [213]:
age_zscore

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

In [215]:
age_zscore2 = (df['age'] - grouped['age'].transform('mean')) / grouped['age'].transform('std')

In [217]:
age_zscore2

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64